   ## Pandas basic assignment 23feb 2023

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd 
import numpy as np
data = np.array([4,8,15,16,23,42])
series = pd.Series(data)
series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int32

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [3]:
import pandas as pd
import numpy as np
var = [12,13,'Pratima','jadon',34,56,78,90,58,56]
var2 = pd.Series(var)

In [4]:
var2

0         12
1         13
2    Pratima
3      jadon
4         34
5         56
6         78
7         90
8         58
9         56
dtype: object

In [7]:
len(var2)

10

### Q3. Create a Pandas DataFrame that contains the following data:

Then, print the DataFrame.

In [8]:
import pandas as pd
import numpy as np
data = { 'Name':['Alice','Bob','Clarie'],
          'Age':[25,30,27],
       'Gender': ['Female','Male','Female']
       }
df = pd.DataFrame(data)

In [9]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Clarie   27  Female

### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns.
while Pandas Series is a one-dimensional labeled array capable of holding data of any type.

In [11]:
import pandas as pd
import numpy as np
data1 = [12,22,12,12,34,34]
# pandas.series
Series = pd.Series(data1)
Series

0    12
1    22
2    12
3    12
4    34
5    34
dtype: int64

In [13]:
#Dataframe
import pandas as pd
import numpy as np
data = { 'Name':['Alice','Bob','Clarie'],
          'Age':[25,30,27],
       'Gender': ['Female','Male','Female']
       }
df = pd.DataFrame(data)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Clarie   27  Female

### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
### you give an example of when you might use one of these functions?

In [26]:
import pandas as pd
import numpy as np
data = { 'Name':['Alice','Bob','Clarie'],
          'Age':[25,30,27],
       'Gender': ['Female','Male','Female'],
        
       }
df = pd.DataFrame(data)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Clarie   27  Female

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Series is immutable 
while DataFrame & Panel are Mutable

### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [40]:
import pandas as pd
import numpy as np
Name = ['Pratima','Shrashti ','Raj' ,'Mayank ']
Gender = [ 'Female','female','Male','Male']
Age = [20,21,18,16]

Name1 = pd.Series(Name)
Gender1 = pd.Series(Gender)
Age1 = pd.Series(Age)

In [41]:
var1 = { 'Name_df' : Name1,
       'Gender_df ' :Gender1,
       'Age_df ': Age1 }

In [42]:
var1

{'Name_df': 0      Pratima
 1    Shrashti
 2          Raj
 3      Mayank
 dtype: object,
 'Gender_df ': 0    Female
 1    female
 2      Male
 3      Male
 dtype: object,
 'Age_df ': 0    20
 1    21
 2    18
 3    16
 dtype: int64}

In [43]:
df = pd.DataFrame(var1)

In [44]:
df

     Name_df Gender_df   Age_df
0    Pratima     Female       20
1  Shrashti      female       21
2        Raj       Male       18
3    Mayank        Male       16